PreProcessing/Modules/TunnelToCurvedPlateModule/TunnelCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/inputParam"

scale 0.001;

// Flat plate length (defined first, used in #calc below)
     xfp ${flowParam.flatPlateLength};
// Middle-left coordinates
     xor #calc "-0.5*$xfp";
     yor 0;
// Inlet (top outer) half height
     yi  ${flowParam.tunnelInletHeight};
// Outlet (top outer) half height
     yo  ${flowParam.tunnelOutletHeight};
// z-planes
     z0  ${flowParam.z0};
     z1  ${flowParam.z1};
// Grid partitions
     Nx  ${flowParam.Nx};
     Ny  ${flowParam.Ny};
// BSpline control points
     xcp1 ${flowParam.xcp1};
     ycp1 ${flowParam.ycp1};
     xcp2 ${flowParam.xcp2};
     ycp2 ${flowParam.ycp2};
     xcp3 ${flowParam.xcp3};
     ycp3 ${flowParam.ycp3};

vertices
(
    // Mid-plane (y = 0)
    ($xor $yor $z1)                         // 0
    ($xor $yor $z0)                         // 1
    (#calc "0.5*$xfp" $yor $z1)             // 2
    (#calc "0.5*$xfp" $yor $z0)             // 3

    // Upper outer line (y > 0)
    ($xor $yi $z1)                          // 4
    ($xor $yi $z0)                          // 5
    (#calc "0.5*$xfp" $yo $z1)              // 6
    (#calc "0.5*$xfp" $yo $z0)              // 7

    // Lower outer line (mirrored, y < 0)
    ($xor #calc "-1*$yi" $z1)               // 8
    ($xor #calc "-1*$yi" $z0)               // 9
    (#calc "0.5*$xfp" #calc "-1*$yo" $z1)   // 10
    (#calc "0.5*$xfp" #calc "-1*$yo" $z0)   // 11
);

blocks
(
    // Upper half: mid-plane -> top
    hex (0 2 3 1 4 6 7 5) internalDuct ($Nx 2 $Ny) simpleGrading (1 1 0.1)

    // Lower half: mid-plane -> bottom 
    hex (1 3 2 0 9 11 10 8) internalDuct ($Nx 2 $Ny) simpleGrading (1 1 0.1)
);

//Uncomment to produce arbitrarily curved edges
edges
(
//   // Upper boundary curvature
//   BSpline 4 6
//   (
//     (#calc "$xor + ($xcp1 - $xor) / 2" $yi $z1)
//     ($xcp1 $ycp1 $z1)
//     ($xcp2 $ycp2 $z1)
//     ($xcp3 $ycp3 $z1)
//     (#calc "$xcp3 + (0.5*$xfp - $xcp3) / 2" $yo $z1)
//   )
//   BSpline 5 7
//   (
//     (#calc "$xor + ($xcp1 - $xor) / 2" $yi $z0)
//     ($xcp1 $ycp1 $z0)
//     ($xcp2 $ycp2 $z0)
//     ($xcp3 $ycp3 $z0)
//     (#calc "$xcp3 + (0.5*$xfp - $xcp3) / 2" $yo $z0)
//   )
//
//   // Lower boundary curvature (mirrored about y=0)
//   BSpline 8 10
//   (
//     (#calc "$xor + ($xcp1 - $xor) / 2" #calc "-1*$yi" $z1)
//     ($xcp1 #calc "-1*$ycp1" $z1)
//     ($xcp2 #calc "-1*$ycp2" $z1)
//     ($xcp3 #calc "-1*$ycp3" $z1)
//     (#calc "$xcp3 + (0.5*$xfp - $xcp3) / 2" #calc "-1*$yo" $z1)
//   )
//   BSpline 9 11
//   (
//     (#calc "$xor + ($xcp1 - $xor) / 2" #calc "-1*$yi" $z0)
//     ($xcp1 #calc "-1*$ycp1" $z0)
//     ($xcp2 #calc "-1*$ycp2" $z0)
//     ($xcp3 #calc "-1*$ycp3" $z0)
//     (#calc "$xcp3 + (0.5*$xfp - $xcp3) / 2" #calc "-1*$yo" $z0)
//   )
);

boundary
(
    // y=0 mid-plane is internal

    upperWall
    {
        type wall;
        faces
        (
           (4 6 7 5)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
           (8 10 11 9)
        );
    }

    inlet
    {
        type patch;
        faces
        (
           (0 4 5 1)         // upper inlet
           (8 0 1 9)         // lower inlet
        );
    }

    outlet
    {
        type patch;
        faces
        (
           (2 6 7 3)         // upper outlet
           (10 2 3 11)       // lower outlet
        );
    }

    right
    {
        type            empty;
        faces
        (
           (0 2 4 6)
           (8 10 0 2)
        );
    }

    left
    {
        type            empty;
        faces
        (
           (1 3 5 7)
           (9 11 1 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
