PreProcessing/Modules/TunnelToCurvedPlateModule/TunnelCase/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (airfoil);
    rho             rhoInf;          // Indicates incompressible
    rhoInf          0.562;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0.72 0 0);      // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         30.0;
    lRef            0.625;           // Nacelle max height (HX half-height)
    Aref            0.625 ;      
}

// ************************************************************************* // 
