PreProcessing/Modules/TunnelToCurvedPlateModule/TunnelCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);

interpolationScheme cellPoint;
setFormat       raw;

fields          (U p);

sets
{
    suctionOutletProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.004234008317 0.08078267144 0.005)
            (-0.004237661564 0.08083824259 0.005)
            (-0.004241365181 0.08089457995 0.005)
            (-0.004245119862 0.08095169406 0.005)
            (-0.00424892631 0.08100959565 0.005)
            (-0.004252785241 0.08106829557 0.005)
            (-0.004256697378 0.08112780481 0.005)
            (-0.004260663454 0.08118813455 0.005)
            (-0.004264684212 0.08124929609 0.005)
            (-0.004268760407 0.08131130091 0.005)
            (-0.004272892804 0.08137416062 0.005)
            (-0.004277082177 0.08143788702 0.005)
            (-0.00428132931 0.08150249206 0.005)
            (-0.004285635002 0.08156798786 0.005)
            (-0.004290000059 0.08163438669 0.005)
            (-0.004294425301 0.081701701 0.005)
            (-0.004298911556 0.08176994341 0.005)
            (-0.004303459666 0.08183912673 0.005)
            (-0.004308070483 0.08190926392 0.005)
            (-0.004312744873 0.08198036814 0.005)
            (-0.004317483711 0.08205245272 0.005)
            (-0.004322287887 0.08212553117 0.005)
            (-0.004327158302 0.0821996172 0.005)
            (-0.004332095868 0.08227472471 0.005)
            (-0.00433710151 0.08235086777 0.005)
            (-0.00434217617 0.08242806066 0.005)
            (-0.004347320797 0.08250631787 0.005)
            (-0.004352536356 0.08258565405 0.005)
            (-0.004357823826 0.0826660841 0.005)
            (-0.004363184197 0.08274762308 0.005)
            (-0.004368618475 0.0828302863 0.005)
            (-0.004374127679 0.08291408925 0.005)
            (-0.004379712842 0.08299904765 0.005)
            (-0.004385375011 0.08308517742 0.005)
            (-0.004391115249 0.08317249471 0.005)
            (-0.00439693463 0.0832610159 0.005)
            (-0.004402834247 0.0833507576 0.005)
            (-0.004408815206 0.08344173662 0.005)
            (-0.004414878628 0.08353397003 0.005)
            (-0.00442102565 0.08362747512 0.005)
            (-0.004427257426 0.08372226942 0.005)
            (-0.004433575123 0.08381837072 0.005)
            (-0.004439979927 0.08391579703 0.005)
            (-0.004446473037 0.08401456661 0.005)
            (-0.004453055672 0.08411469799 0.005)
            (-0.004459729066 0.08421620995 0.005)
            (-0.00446649447 0.08431912153 0.005)
            (-0.004473353154 0.084423452 0.005)
            (-0.004480306403 0.08452922095 0.005)
            (-0.00448735552 0.08463644821 0.005)
            (-0.004494501828 0.08474515388 0.005)
            (-0.004501746667 0.08485535833 0.005)
            (-0.004509091395 0.08496708226 0.005)
            (-0.00451653739 0.08508034659 0.005)
            (-0.004524086048 0.08519517258 0.005)
            (-0.004531738784 0.08531158174 0.005)
            (-0.004539497033 0.0854295959 0.005)
            (-0.004547362249 0.0855492372 0.005)
            (-0.004555335909 0.08567052809 0.005)
            (-0.004563419506 0.08579349128 0.005)
            (-0.004571614558 0.08591814984 0.005)
            (-0.0045799226 0.08604452715 0.005)
            (-0.004588345191 0.08617264691 0.005)
            (-0.004596883909 0.08630253314 0.005)
            (-0.004605540355 0.0864342102 0.005)
            (-0.004614316154 0.08656770277 0.005)
            (-0.00462321295 0.08670303589 0.005)
            (-0.004632232412 0.08684023493 0.005)
            (-0.004641376232 0.08697932563 0.005)
            (-0.004650646123 0.08712033406 0.005)
            (-0.004660043824 0.08726328666 0.005)
            (-0.004669571098 0.08740821024 0.005)
            (-0.00467922973 0.08755513198 0.005)
            (-0.004689021531 0.08770407942 0.005)
            (-0.004698948339 0.0878550805 0.005)
            (-0.004709012013 0.08800816353 0.005)
            (-0.004719214443 0.0881633572 0.005)
            (-0.004729557539 0.08832069064 0.005)
            (-0.004740043242 0.08848019333 0.005)
            (-0.004750673519 0.0886418952 0.005)
            (-0.004761450363 0.08880582654 0.005)
            (-0.004772375793 0.08897201811 0.005)
            (-0.00478345186 0.08914050108 0.005)
            (-0.004794680639 0.08931130703 0.005)
            (-0.004806064237 0.08948446799 0.005)
            (-0.004817604788 0.08966001643 0.005)
            (-0.004829304456 0.08983798528 0.005)
            (-0.004841165435 0.09001840789 0.005)
            (-0.004853189948 0.09020131811 0.005)
            (-0.004865380252 0.09038675022 0.005)
            (-0.004877738631 0.09057473901 0.005)
            (-0.004890267403 0.09076531972 0.005)
            (-0.004902968917 0.09095852809 0.005)
            (-0.004915845555 0.09115440035 0.005)
            (-0.004928899732 0.09135297322 0.005)
            (-0.004942133895 0.09155428396 0.005)
            (-0.004955550526 0.09175837029 0.005)
            (-0.00496915214 0.09196527049 0.005)
            (-0.004982941289 0.09217502335 0.005)
...
        );
    }
    pressureOutletProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.3482563715 -0.06165742968 0.005)
            (-0.34826559 -0.06171235252 0.005)
            (-0.3482749357 -0.06176803262 0.005)
            (-0.3482844102 -0.06182448042 0.005)
            (-0.3482940153 -0.0618817065 0.005)
            (-0.3483037529 -0.06193972159 0.005)
            (-0.3483136247 -0.06199853657 0.005)
            (-0.3483236326 -0.06205816248 0.005)
            (-0.3483337785 -0.06211861049 0.005)
            (-0.3483440643 -0.06217989193 0.005)
            (-0.3483544919 -0.0622420183 0.005)
            (-0.3483650632 -0.06230500124 0.005)
            (-0.3483757804 -0.06236885257 0.005)
            (-0.3483866453 -0.06243358426 0.005)
            (-0.34839766 -0.06249920845 0.005)
            (-0.3484088266 -0.06256573744 0.005)
            (-0.3484201471 -0.06263318371 0.005)
            (-0.3484316237 -0.06270155991 0.005)
            (-0.3484432586 -0.06277087885 0.005)
            (-0.3484550538 -0.06284115353 0.005)
            (-0.3484670117 -0.06291239714 0.005)
            (-0.3484791345 -0.06298462303 0.005)
            (-0.3484914244 -0.06305784475 0.005)
            (-0.3485038838 -0.06313207602 0.005)
            (-0.3485165149 -0.06320733076 0.005)
            (-0.3485293202 -0.06328362309 0.005)
            (-0.3485423021 -0.06336096731 0.005)
            (-0.3485554629 -0.06343937793 0.005)
            (-0.3485688051 -0.06351886965 0.005)
            (-0.3485823315 -0.06359945737 0.005)
            (-0.3485960442 -0.0636811562 0.005)
            (-0.348609946 -0.06376398147 0.005)
            (-0.3486240395 -0.0638479487 0.005)
            (-0.3486383273 -0.06393307364 0.005)
            (-0.3486528121 -0.06401937225 0.005)
            (-0.3486674966 -0.06410686072 0.005)
            (-0.3486823836 -0.06419555545 0.005)
            (-0.3486974758 -0.06428547308 0.005)
            (-0.3487127762 -0.06437663045 0.005)
            (-0.3487282875 -0.06446904467 0.005)
            (-0.3487440126 -0.06456273306 0.005)
            (-0.3487599545 -0.0646577132 0.005)
            (-0.3487761163 -0.06475400288 0.005)
            (-0.3487925009 -0.06485162019 0.005)
            (-0.3488091113 -0.06495058339 0.005)
            (-0.3488259509 -0.06505091107 0.005)
            (-0.3488430225 -0.06515262203 0.005)
            (-0.3488603296 -0.06525573534 0.005)
            (-0.3488778753 -0.06536027035 0.005)
            (-0.3488956629 -0.06546624665 0.005)
            (-0.3489136957 -0.06557368411 0.005)
            (-0.3489319773 -0.06568260288 0.005)
            (-0.3489505108 -0.06579302338 0.005)
            (-0.3489692999 -0.06590496633 0.005)
            (-0.348988348 -0.0660184527 0.005)
            (-0.3490076588 -0.06613350377 0.005)
            (-0.3490272358 -0.06625014114 0.005)
            (-0.3490470827 -0.06636838666 0.005)
            (-0.3490672033 -0.06648826251 0.005)
            (-0.3490876013 -0.06660979116 0.005)
            (-0.3491082805 -0.06673299541 0.005)
            (-0.3491292448 -0.06685789835 0.005)
            (-0.3491504982 -0.06698452341 0.005)
            (-0.3491720447 -0.06711289433 0.005)
            (-0.3491938882 -0.06724303518 0.005)
            (-0.3492160329 -0.06737497037 0.005)
            (-0.3492384829 -0.06750872464 0.005)
            (-0.3492612425 -0.06764432306 0.005)
            (-0.3492843157 -0.06778179106 0.005)
            (-0.3493077072 -0.06792115443 0.005)
            (-0.3493314212 -0.06806243929 0.005)
            (-0.3493554621 -0.06820567213 0.005)
            (-0.3493798345 -0.06835087982 0.005)
            (-0.349404543 -0.06849808958 0.005)
            (-0.3494295921 -0.06864732901 0.005)
            (-0.3494549866 -0.0687986261 0.005)
            (-0.3494807312 -0.06895200923 0.005)
            (-0.3495068307 -0.06910750714 0.005)
            (-0.3495332902 -0.06926514901 0.005)
            (-0.3495601145 -0.06942496439 0.005)
            (-0.3495873085 -0.06958698324 0.005)
            (-0.3496148775 -0.06975123595 0.005)
            (-0.3496428267 -0.06991775332 0.005)
            (-0.3496711612 -0.07008656658 0.005)
            (-0.3496998863 -0.07025770738 0.005)
            (-0.3497290075 -0.0704312078 0.005)
            (-0.3497585302 -0.07060710037 0.005)
            (-0.3497884599 -0.0707854181 0.005)
            (-0.3498188023 -0.07096619441 0.005)
            (-0.3498495631 -0.07114946319 0.005)
            (-0.349880748 -0.07133525882 0.005)
            (-0.3499123629 -0.07152361614 0.005)
            (-0.3499444136 -0.07171457047 0.005)
            (-0.3499769063 -0.07190815759 0.005)
            (-0.350009847 -0.07210441383 0.005)
            (-0.3500432418 -0.07230337599 0.005)
            (-0.3500770971 -0.07250508136 0.005)
            (-0.3501114191 -0.07270956777 0.005)
            (-0.3501462143 -0.07291687357 0.005)
...
        );
    }
    farfieldProbes
    {
        type    cloud;
        axis    xyz;
        points
        (
            (-0.03737310075 0.5596036897 0.005)
            (-0.03737310075 0.5596036897 0.005)
            (-0.04068972804 0.5593680166 0.005)
            (-0.04068972804 0.5593680166 0.005)
            (-0.0438872423 0.5591405502 0.005)
            (-0.0438872423 0.5591405502 0.005)
            (-0.04696976653 0.5589210454 0.005)
            (-0.04696976653 0.5589210454 0.005)
            (-0.04995866541 0.5587072521 0.005)
            (-0.04995866541 0.5587072521 0.005)
            (-0.05304929374 0.5584819233 0.005)
            (-0.05304929374 0.5584819233 0.005)
            (-0.0563319843 0.5582390832 0.005)
            (-0.0563319843 0.5582390832 0.005)
            (-0.05973978655 0.5579854365 0.005)
            (-0.05973978655 0.5579854365 0.005)
            (-0.06318161274 0.5577266511 0.005)
            (-0.06318161274 0.5577266511 0.005)
            (-0.06647660622 0.5574724864 0.005)
            (-0.06647660622 0.5574724864 0.005)
            (-0.06969668491 0.5572089024 0.005)
            (-0.06969668491 0.5572089024 0.005)
            (-0.07273550355 0.5569467555 0.005)
            (-0.07273550355 0.5569467555 0.005)
            (-0.07563833281 0.5566973345 0.005)
            (-0.07563833281 0.5566973345 0.005)
            (-0.07872869156 0.5564351304 0.005)
            (-0.07872869156 0.5564351304 0.005)
            (-0.08195311953 0.5561580027 0.005)
            (-0.08195311953 0.5561580027 0.005)
            (-0.08523264248 0.5558731247 0.005)
            (-0.08523264248 0.5558731247 0.005)
            (-0.08866625712 0.5555731753 0.005)
            (-0.08866625712 0.5555731753 0.005)
            (-0.09195192986 0.5552829865 0.005)
            (-0.09195192986 0.5552829865 0.005)
            (-0.09523457459 0.5549835736 0.005)
            (-0.09523457459 0.5549835736 0.005)
            (-0.0984305129 0.5546788564 0.005)
            (-0.0984305129 0.5546788564 0.005)
            (-0.1013863347 0.554391789 0.005)
            (-0.1013863347 0.554391789 0.005)
            (-0.1043341769 0.5541097149 0.005)
            (-0.1043341769 0.5541097149 0.005)
            (-0.1075285424 0.5538019526 0.005)
            (-0.1075285424 0.5538019526 0.005)
            (-0.1108252 0.5534788627 0.005)
            (-0.1108252 0.5534788627 0.005)
            (-0.1141326414 0.5531514741 0.005)
            (-0.1141326414 0.5531514741 0.005)
            (-0.1175962309 0.5528064034 0.005)
            (-0.1175962309 0.5528064034 0.005)
            (-0.1208310923 0.5524801871 0.005)
            (-0.1208310923 0.5524801871 0.005)
            (-0.1240547348 0.5521431297 0.005)
            (-0.1240547348 0.5521431297 0.005)
            (-0.1271654016 0.5518053814 0.005)
            (-0.1271654016 0.5518053814 0.005)
            (-0.1299680034 0.5515001427 0.005)
            (-0.1299680034 0.5515001427 0.005)
            (-0.132822557 0.5511927243 0.005)
            (-0.132822557 0.5511927243 0.005)
            (-0.1358379249 0.550864477 0.005)
            (-0.1358379249 0.550864477 0.005)
            (-0.1389237134 0.5505248407 0.005)
            (-0.1389237134 0.5505248407 0.005)
            (-0.1421024546 0.5501730414 0.005)
            (-0.1421024546 0.5501730414 0.005)
            (-0.1452589812 0.549821462 0.005)
            (-0.1452589812 0.549821462 0.005)
            (-0.1483399297 0.5494729716 0.005)
            (-0.1483399297 0.5494729716 0.005)
            (-0.1513362105 0.5491239074 0.005)
            (-0.1513362105 0.5491239074 0.005)
            (-0.1541587553 0.5487877884 0.005)
            (-0.1541587553 0.5487877884 0.005)
            (-0.1568934875 0.5484644111 0.005)
            (-0.1568934875 0.5484644111 0.005)
            (-0.1598086007 0.5481207789 0.005)
            (-0.1598086007 0.5481207789 0.005)
            (-0.1628395341 0.5477588591 0.005)
            (-0.1628395341 0.5477588591 0.005)
            (-0.1658856878 0.5473912807 0.005)
            (-0.1658856878 0.5473912807 0.005)
            (-0.1691083302 0.5470005235 0.005)
            (-0.1691083302 0.5470005235 0.005)
            (-0.1722039698 0.5466225326 0.005)
            (-0.1722039698 0.5466225326 0.005)
            (-0.1752825121 0.5462394641 0.005)
            (-0.1752825121 0.5462394641 0.005)
            (-0.1782726533 0.5458562924 0.005)
            (-0.1782726533 0.5458562924 0.005)
            (-0.1810487212 0.5454948352 0.005)
            (-0.1810487212 0.5454948352 0.005)
            (-0.1838119071 0.5451384019 0.005)
            (-0.1838119071 0.5451384019 0.005)
            (-0.1868211341 0.5447497171 0.005)
            (-0.1868211341 0.5447497171 0.005)
            (-0.1898626687 0.5443525832 0.005)
...
        );
    }
}

// ************************************************************************* //
